[
  {
    "foodname": "Spaghetti alla  Carbonara",
    "foodimage": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg",
    "foodcategory": "Pasta",
    "price": 12.99,
    "madeby": "Chef Antonio",
    "foodorigin": "Italy",
    "description": "Delicious pasta dish with eggs, cheese, pancetta, and black pepper.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\r\n\r\nSTEP 3\r\nBeat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\r\n\r\nSTEP 4\r\nAdd 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\r\n\r\nSTEP 5\r\nSquash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\r\n\r\nSTEP 6\r\nWhile the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\r\n\r\nSTEP 7\r\nLeave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\r\n\r\nSTEP 8\r\nKeep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\r\n\r\nSTEP 9\r\nMix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\r\n\r\nSTEP 10\r\nTake the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\r\n\r\nSTEP 11\r\nAdd extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\r\n\r\nSTEP 12\r\nUse a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived."
  },
  {
    "foodname": "Sushi Combo",
    "foodimage": "https://www.themealdb.com/images/media/meals/g046bb1663960946.jpg",
    "foodcategory": "Seafood",
    "price": 18.95,
    "madeby": "Sushi Master Ken",
    "foodorigin": "Japan",
    "description": "Fresh and beautifully crafted sushi with a variety of fish and toppings.",
    "orderamount": 0,
    "quantity": 24,
    "strInstructions": "STEP 1\r\nTO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip your hands in the vinegared water, then pat handfuls of rice on top in a 1cm thick layer, leaving the furthest edge from you clear.\r\n\r\nSTEP 2\r\nSpread over some Japanese mayonnaise. Use a spoon to spread out a thin layer of mayonnaise down the middle of the rice.\r\n\r\nSTEP 3\r\nAdd the filling. Get your child to top the mayonnaise with a line of their favourite fillings – here we’ve used tuna and cucumber.\r\n\r\nSTEP 4\r\nRoll it up. Lift the edge of the mat over the rice, applying a little pressure to keep everything in a tight roll.\r\n\r\nSTEP 5\r\nStick down the sides like a stamp. When you get to the edge without any rice, brush with a little water and continue to roll into a tight roll.\r\n\r\nSTEP 6\r\nWrap in cling film. Remove the mat and roll tightly in cling film before a grown-up cuts the sushi into thick slices, then unravel the cling film.\r\n\r\nSTEP 7\r\nTO MAKE PRESSED SUSHI: Layer over some smoked salmon. Line a loaf tin with cling film, then place a thin layer of smoked salmon inside on top of the cling film.\r\n\r\nSTEP 8\r\nCover with rice and press down. Press about 3cm of rice over the fish, fold the cling film over and press down as much as you can, using another tin if you have one.\r\n\r\nSTEP 9\r\nTip it out like a sandcastle. Turn block of sushi onto a chopping board. Get a grown-up to cut into fingers, then remove the cling film.\r\n\r\nSTEP 10\r\nTO MAKE SUSHI BALLS: Choose your topping. Get a small square of cling film and place a topping, like half a prawn or a small piece of smoked salmon, on it. Use damp hands to roll walnut-sized balls of rice and place on the topping.\r\n\r\nSTEP 11\r\nMake into tight balls. Bring the corners of the cling film together and tighten into balls by twisting it up, then unwrap and serve."
  },
  {
    "foodname": "Lamb Tzatziki Burgers",
    "foodimage": "https://www.themealdb.com/images/media/meals/k420tj1585565244.jpg",
    "foodcategory": "Lamb",
    "price": 9.99,
    "madeby": "Chef Sarah",
    "foodorigin": "Greek",
    "description": "Classic Lamb Tzatziki Burgers with juicy lamb slices, cheese, lettuce, and tomato.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "Tip the bulghar into a pan, cover with water and boil for 10 mins. Drain really well in a sieve, pressing out any excess water.\r\n\r\nTo make the tzatziki, squeeze and discard the juice from the cucumber, then mix into the yogurt with the chopped mint and a little salt.\r\n\r\nWork the bulghar into the lamb with the spices, garlic (if using) and seasoning, then shape into 4 burgers. Brush with a little oil and fry or barbecue for about 5 mins each side until cooked all the way through. Serve in the buns (toasted if you like) with the tzatziki, tomatoes, onion and a few mint leaves."
  },
  {
    "foodname": "Recheado Masala Fish",
    "foodimage": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
    "foodcategory": "Seafood",
    "price": 14.5,
    "madeby": "Chef Raj",
    "foodorigin": "India",
    "description": "Creamy tomato-based curry with tender chicken pieces and Indian spices.",
    "orderamount": 0,
    "quantity": 30,
    "strInstructions": "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar.\r\nAdd sugar and salt.\r\nAlso add turmeric powder.\r\nCombine all nicely and marinate for 35-40 mins.\r\nGrind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish.\r\nRinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity.\r\nNow stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins.\r\nPlace oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels.\r\nFry until golden brown from both sides\r\nServe the recheado mackerels hot with salad, lime wedges, rice and curry.\r\nNotes\r\n1. Ensure the masala paste is thick else the result won't be good.\r\n2. If you aren't able to find kashmiri chilies then use bedgi chilies or kashmiri red chili powder.\r\n3. You could use white vinegar or coconut vinegar.\r\n4. Any left over paste could be stored in the fridge for future use.\r\n5. Cinnamon could be avoided as it's a strong spice used generally for meat or chicken."
  },
  {
    "foodname": "Salmon Avocado Salad",
    "foodimage": "https://www.themealdb.com/images/media/meals/1549542994.jpg",
    "foodcategory": "Seafood",
    "price": 8.75,
    "madeby": "Chef Emily",
    "foodorigin": "USA",
    "description": "Fresh romaine lettuce, croutons, and salmon fillet dressing topped with parmesan cheese.",
    "orderamount": 0,
    "quantity": 24,
    "strInstructions": "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.\r\n\r\nHeat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm."
  },
  {
    "foodname": "Szechuan Beef",
    "foodimage": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
    "foodcategory": "Chinese",
    "price": 12.25,
    "madeby": "Chef Li",
    "foodorigin": "China",
    "description": "Spicy stir-fry with tofu, vegetables, and Szechuan sauce.",
    "orderamount": 0,
    "quantity": 40
  },
  {
    "foodname": "Margherita Pizza",
    "foodimage": "https://www.themealdb.com/images/media/meals/x0lk931587671540.jpg",
    "foodcategory": "Pizza",
    "price": 10.99,
    "madeby": "Pizza Chef Luigi",
    "foodorigin": "Italy",
    "description": "Traditional Italian pizza with tomato sauce, mozzarella, and fresh basil.",
    "orderamount": 0,
    "quantity": 14,
    "strInstructions": "1 Preheat the oven to 230°C.\r\n\r\n2 Add the sugar and crumble the fresh yeast into warm water.\r\n\r\n3 Allow the mixture to stand for 10 – 15 minutes in a warm place (we find a windowsill on a sunny day works best) until froth develops on the surface.\r\n\r\n4 Sift the flour and salt into a large mixing bowl, make a well in the middle and pour in the yeast mixture and olive oil.\r\n\r\n5 Lightly flour your hands, and slowly mix the ingredients together until they bind.\r\n\r\n6 Generously dust your surface with flour.\r\n\r\n7 Throw down the dough and begin kneading for 10 minutes until smooth, silky and soft.\r\n\r\n8 Place in a lightly oiled, non-stick baking tray (we use a round one, but any shape will do!)\r\n\r\n9 Spread the passata on top making sure you go to the edge.\r\n\r\n10 Evenly place the mozzarella (or other cheese) on top, season with the oregano and black pepper, then drizzle with a little olive oil.\r\n\r\n11 Cook in the oven for 10 – 12 minutes until the cheese slightly colours.\r\n\r\n12 When ready, place the basil leaf on top and tuck in!"
  },
  {
    "foodname": "Chocolate Gateau",
    "foodimage": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg",
    "foodcategory": "Desserts",
    "price": 9.5,
    "madeby": "Pastry Chef Marie",
    "foodorigin": "France",
    "description": "Plain chocolate cake served with a variety of dipping items like fruits and marshmallows.",
    "orderamount": 0,
    "quantity": 30,
    "strInstructions": "Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r\nBreak the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r\nPlace the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r\nSpread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely."
  },
  {
    "foodname": "Aubergine Paella",
    "foodimage": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
    "foodcategory": "Vegan",
    "price": 16.75,
    "madeby": "Chef Carlos",
    "foodorigin": "Spain",
    "description": "Spanish rice dish with a mix of seafood, saffron, and vegetables.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.\r\n\r\n2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.\r\n\r\n3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.\r\n\r\n4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving."
  },
  {
    "foodname": "Leblebi Soup",
    "foodimage": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg",
    "foodcategory": "Soups",
    "price": 4.99,
    "madeby": "Chef Hiroshi",
    "foodorigin": "Tunisia",
    "description": "Savory Tunisian soup made with miso paste, seaweed, and tofu.",
    "orderamount": 0,
    "quantity": 5,
    "strInstructions": "Heat the oil in a large pot. Add the onion and cook until translucent.\r\nDrain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.\r\nIn the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.\r\nAdd the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.\r\nSeason to taste with salt, pepper and lemon juice and serve hot."
  },
  {
    "foodname": "BBQ Pork Sloppy Joes",
    "foodimage": "https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg",
    "foodcategory": "Barbecue",
    "price": 15.99,
    "madeby": "Chef Dave",
    "foodorigin": "USA",
    "description": "Tender, smoky, and flavorful barbecue ribs with a tangy sauce.",
    "orderamount": 0,
    "quantity": 2,
    "strInstructions": "1\r\n\r\nPreheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.\r\n\r\n2\r\n\r\nMeanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.\r\n\r\n3\r\n\r\nTo bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.\r\n\r\n5\r\n\r\nWhile pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.\r\n\r\n6\r\n\r\nMeanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side."
  },
  {
    "foodname": "Lasagna Sandwiches",
    "foodimage": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg",
    "foodcategory": "Pasta",
    "price": 13.5,
    "madeby": "Chef Maria",
    "foodorigin": "USA",
    "description": "Layers of pasta, ricotta, mozzarella, and meat sauce baked to perfection.",
    "orderamount": 0,
    "quantity": 3,
    "strInstructions": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein."
  },
  {
    "foodname": "Ma Po Tofu",
    "foodimage": "https://www.themealdb.com/images/media/meals/1525874812.jpg",
    "foodcategory": "Beef",
    "price": 11.25,
    "madeby": "Chef Javier",
    "foodorigin": "Chinese",
    "description": "Tacos filled with spicy tofu, salsa, and fresh toppings.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "Add a small pinch of salt and sesame oil to minced beef. Mix well and set aside.\r\nMix 1 tablespoon of cornstarch with 2 and ½ tablespoons of water in a small bowl to make water starch.\r\nCut tofu into square cubes (around 2cms). Bring a large amount of water to a boil and then add a pinch of salt. Slide the tofu in and cook for 1 minute. Move out and drain.\r\nGet a wok and heat up around 2 tablespoons of oil, fry the minced meat until crispy. Transfer out beef out and leave the oil in.\r\nFry doubanjiang for 1 minute over slow fire and then add garlic, scallion white, ginger and fermented black beans to cook for 30 seconds until aroma. Then mix pepper flakes in.\r\nAdd water to the seasonings and bring to boil over high fire. Gently slide the tofu cubes. Add light soy sauce and beef.Slow the heat after boiling and then simmer for 6-8 minutes. Then add chopped garlic greens.\r\nStir the water starch and then pour half of the mixture to the simmering pot. Wait for around 30 seconds and then pour the other half. You can slightly taste the tofu and add pinch of salt if not salty enough. By the way, if you feel it is too spicy, add some sugar can milder the taste. But be carefully as the broth is very hot at this point.\r\nTransfer out when almost all the seasonings stick to tofu cubes. Sprinkle Szechuan peppercorn powder (to taste)and chopped garlic greens if using.\r\nServe immediately with steamed rice."
  },
  {
    "foodname": "New York Cheesecake",
    "foodimage": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
    "foodcategory": "Desserts",
    "price": 8.99,
    "madeby": "Pastry Chef Lisa",
    "foodorigin": "USA",
    "description": "Creamy Cheesecake with a raspberry swirl and a graham cracker crust.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath."
  },
  {
    "foodname": "Beef Stroganoff",
    "foodimage": "https://www.themealdb.com/images/media/meals/svprys1511176755.jpg",
    "foodcategory": "Russian",
    "price": 14.75,
    "madeby": "Chef Ivan",
    "foodorigin": "Russia",
    "description": "Tender beef strips in a rich sour cream sauce, served with noodles.",
    "orderamount": 0,
    "quantity": 20,
    "strInstructions": "Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.\r\nTip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice."
  },
  {
    "foodname": "Japanese Katsudon",
    "foodimage": "https://www.themealdb.com/images/media/meals/d8f6qx1604182128.jpg",
    "foodcategory": "Japanese",
    "price": 9.75,
    "madeby": "Chef Akihiro",
    "foodorigin": "Japan",
    "description": "Japanese rice bowl with thinly sliced beef and onions in a savory sauce.",
    "orderamount": 0,
    "quantity": 56,
    "strInstructions": "STEP 1\r\nHeat the oil in a pan, fry the sliced onion until golden brown, then add the tonkatsu (see recipe here), placing it in the middle of the pan. Mix the dashi, soy, mirin and sugar together and tip three-quarters of the mixture around the tonkatsu. Sizzle for a couple of mins so the sauce thickens a little and the tonkatsu reheats.\r\n\r\nSTEP 2\r\nTip the beaten eggs around the tonkatsu and cook for 2-3 mins until the egg is cooked through but still a little runny. Divide the rice between two bowls, then top each with half the egg and tonkatsu mix, sprinkle over the chives and serve immediately, drizzling with a little more soy if you want an extra umami kick."
  },
  {
    "foodname": "Chicken Quinoa Greek Salad",
    "foodimage": "https://www.themealdb.com/images/media/meals/k29viq1585565980.jpg",
    "foodcategory": "Salads",
    "price": 7.5,
    "madeby": "Chef Maria",
    "foodorigin": "Greece",
    "description": "Fresh salad with tomatoes, cucumbers, olives, feta cheese, and Greek dressing.",
    "orderamount": 0,
    "quantity": 28,
    "strInstructions": "Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.\r\n\r\nMeanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.\r\n\r\nNext, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices."
  },
  {
    "foodname": "Fish pie",
    "foodimage": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
    "foodcategory": "Seafood",
    "price": 11.99,
    "madeby": "Chef James",
    "foodorigin": "United Kingdom",
    "description": "Baked battered White Fish Fillets with seasoned Prawns and tartar sauce.",
    "orderamount": 0,
    "quantity": 20,
    "strInstructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\r\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\r\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\r\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\r\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens."
  },
  {
    "foodname": "General Tso's Chicken",
    "foodimage": "https://www.themealdb.com/images/media/meals/1529444113.jpg",
    "foodcategory": "Chinese",
    "price": 10.25,
    "madeby": "Chef Rosa",
    "foodorigin": "Chinese",
    "description": "Corn tortillas filled with General Tso's Chicken, cheese, and duck sauce.",
    "orderamount": 0,
    "quantity": 6,
    "strInstructions": "DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate"
  },
  {
    "foodname": "Margarita",
    "foodimage": "https://www.thecocktaildb.com/images/media/drink/5noda61589575158.jpg",
    "foodcategory": "Drinks",
    "price": 6.99,
    "madeby": "Bartender Juan",
    "foodorigin": "Mexico",
    "description": "Classic cocktail made with tequila, lime juice, and orange liqueur.",
    "orderamount": 0,
    "quantity": 5,
    "strInstructions": "Rub the rim of the glass with the lime slice to make the salt stick to it. Take care to moisten only the outer rim and sprinkle the salt on it. The salt should present to the lips of the imbiber and never mix into the cocktail. Shake the other ingredients with ice, then carefully pour into the glass."
  },
  {
    "foodname": "Laksa King Prawn Noodles",
    "foodimage": "https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg",
    "foodcategory": "Seafood",
    "price": 8.5,
    "madeby": "Chef Yuki",
    "foodorigin": "Malaysian",
    "description": "Malaysian Laksa King Prawn Noodles with broth, noodles, and various toppings.",
    "orderamount": 0,
    "quantity": 10,
    "strInstructions": "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil.\r\nAdd the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander.\r\nServe in bowls with the remaining coriander and lime wedges on top for squeezing over."
  }
]
